Repository: theforeman/hammer_cli_foreman_azure_rm
Catalog: locale/*/hammer_cli_foreman_azure_rm.po
Languages: de, es, fr, ja, ka, ko, pt_br, zh_cn

source: Existing Azure Resource Group of user
de: Vorhandene Azure-Ressourcengruppe des Benutzers
es: Grupo de recursos Azure existente del usuario
fr: Groupe de ressources Azure existant de l'utilisateur
ja: ユーザーの既存の Azure リソースグループ
ka: მომხმარებლის Azure-ს რესურსების არსებული ჯგუფი
ko: 사용자의 기존 Azure 리소스 그룹
pt_br: Grupo de recursos de usuário existentes do Azure
zh_cn: 用户现有的 Azure 资源组

source: VM Size, eg. Standard_A0 etc.
de: VM-Größe, z. Standard_A0 usw.
es: Tamaño de la máquina virtual, p. ej., Standard_A0, etc.
fr: Taille de la VM, par exemple Standard_A0 etc.
ja: 仮想マシンサイズ (例: Standard_A0)
ka: ვმ-ის ზომა. მაგ Standard_A0 და ა.შ.
ko: VM 크기(예: Standard_A0 등)
pt_br: Tamanho da MV, por exemplo, Standard_A0 etc.
zh_cn: 虚拟机的大小，例如 Standard_A0 等

source: The Admin username
de: Der Admin-Benutzername
es: El nombre de usuario del administrador
fr: Le nom d'utilisateur Admin
ja: 管理者のユーザー名
ka: ადმინისტრატორის მომხმარებლის სახელი
ko: 관리자 이름
pt_br: O nome de usuário Admin
zh_cn: 管理员用户名

source: The Admin password
de: Das Admin-Passwort
es: La contraseña del administrador
fr: Le mot de passe Admin
ja: 管理者のパスワード
ka: ადმინისტრატორის პაროლი
ko: 관리자 비밀번호
pt_br: A senha de Admin
zh_cn: 管理员密码

source: OS type eg. Linux
de: Betriebssystemtyp zB. Linux
es: Tipo de sistema operativo, p. ej., Linux
fr: Type de système d'exploitation, par exemple Linux
ja: OS タイプ (例: Linux)
ka: ოს-ის ტიპი. მაგ: Linux
ko: OS 유형 예: Linux
pt_br: Tipo de SO, por exemplo, Linux
zh_cn: 操作系统类型，例如 Linux

source: SSH key for passwordless authentication
de: SSH-Schlüssel für die passwortlose Authentifizierung
es: Clave SSH para la autenticación sin contraseña
fr: Clé SSH pour une authentification sans mot de passe
ja: パスワードなし認証用の SSH キー
ka: SSH გასაღები უპაროლო ავთენტიკაციისთვის
ko: 비밀번호 없는 인증을 위한 SSH 키
pt_br: Chave SSH para autenticação sem senha
zh_cn: 用于无密码身份验证的 SSH 密钥

source: OS disk caching
de: Caching von Betriebssystem-Festplatten
es: Almacenamiento en caché de disco de SO
fr: Mise en cache du disque du système d’exploitation
ja: OS ディスクキャッシング
ka: ოს-ის დისკის ქეში
ko: OS 디스크 캐싱
pt_br: Cache em disco do SO
zh_cn: 操作系统磁盘缓存

source: Premium OS Disk, Boolean as 0 or 1
de: Premium OS Disk, Boolean als 0 oder 1
es: Disco de SO Premium, booleano como 0 o 1
fr: Disque Premium OS, booléen comme 0 ou 1
ja: プレミアム OS ディスク、ブール値 0 または 1
ka: ოს-ის პრემიუმ დისკი. 0 ან 1
ko: 프리미엄 OS 디스크, 부울은 0 또는 1입니다.
pt_br: Disco de SO Premium, Booleano como 0 ou 1
zh_cn: 高级操作系统磁盘，布尔值 0 或 1

source: Custom Script Command
de: Benutzerdefinierter Skriptbefehl
es: Comando de script personalizado
fr: Commande de script personnalisé
ja: カスタムスクリプトコマンド
ka: ხელით შეყვანილი სკრიპტი
ko: 사용자 정의 스크립트 명령
pt_br: Comando de script personalizado
zh_cn: 自定义脚本命令

source: Comma seperated file URIs
de: Durch Kommas getrennte Datei-URIs
es: URI de archivo separado por comas
fr: Fichier URI séparé par des virgules
ja: コンマ区切りファイル URI
ka: ფაილების მძიმით დაშორებული URI-ები
ko: 쉼표로 구분된 파일 URI
pt_br: URIs de arquivo separado por vírgula
zh_cn: 逗号分隔的文件 URI

source: Select one of available Azure Subnets, must be an ID
de: Wählen Sie eines der verfügbaren Azure-Subnetze aus, muss eine ID sein
es: Seleccione una de las subredes de Azure disponibles; debe ser una ID
fr: Sélectionnez un des sous-réseaux Azur disponibles, doit être un ID
ja: 利用可能な Azure サブネットの 1 つを選択してください。ID である必要があります
ka: აირჩიეთ Azure-ის ერთერთი ხელმისაწვდომი ქვექსელი. უნდა წარმოადგენდეს ID-ს
ko: 사용 가능한 Azure 서브넷 중 하나를 선택하세요. ID여야 합니다.
pt_br: Selecione uma das sub-redes do Azure disponíveis, deve ser uma ID
zh_cn: 选择一个可用的 Azure 子网，必须是一个 ID

source: Public IP (None, Static, Dynamic)
de: Öffentliche IP (Keine, Statisch, Dynamisch)
es: IP Pública (ninguna, estática, dinámica)
fr: Propriété intellectuelle publique (Aucune, Statique, Dynamique)
ja: パブリック IP (なし、静的、動的)
ka: საჯარო IP (არაფერი, სტატიკური, დინამიკური)
ko: 공용 IP(없음, 고정, 동적)
pt_br: IP público (nenhum, estático, dinâmico)
zh_cn: 公共 IP（无、静态或动态）

source: Static Private IP (expressed as true or false)
de: Statische private IP (ausgedrückt als wahr oder falsch)
es: IP privada estática (expresada como verdadera o falsa)
fr: Propriété intellectuelle privée statique (exprimée comme vraie ou fausse)
ja: 静的プライベート IP (true または false で表現)
ka: სტატიკური შიდა IP (0 ან 1)
ko: 정적 개인 IP(true 또는 false로 표현됨)
pt_br: IP privado estático (expresso como verdadeiro ou falso)
zh_cn: 静态私有 IP（true 或 false）

source: Volume Size in GB (integer value)
de: Volume-Größe in GB (Ganzzahlwert)
es: Tamaño del volumen en GB (valor entero)
fr: Taille du volume en Go (nombre entier)
ja: ボリュームサイズ (GB 単位)、整数値
ka: საცავის ზომა, მთელ რიცხვებში, გიგაბაიტებით
ko: GB 단위의 볼륨 크기(정수 값)
pt_br: Tamanho do volume em GB (valor inteiro)
zh_cn: 卷大小，以 GB 为单位（整数值）

source: Data Disk Caching (None, ReadOnly, ReadWrite)
de: Caching von Datenfestplatten (keine, ReadOnly, ReadWrite)
es: Caché de disco de datos (ninguno, solo lectura, lectura y escritura)
fr: Mise en cache des disques de données (Aucune, Lecture seule, Lecture-écriture)
ja: データディスクキャッシュ (なし、読み取り専用、読み取り書き込み)
ka: მონაცემების დისკის ქეში (არა, მხოლოდკითხვა, წერაკითხვა)
ko: 데이터 디스크 캐싱(없음, 읽기 전용, 읽기/쓰기)
pt_br: Cache de disco de dados (nenhum, somente leitura, leitura e gravação)
zh_cn: 数据磁盘缓存（无、只读、读写）

source: tenant
es: inquilino
ja: テナント
ko: 테넌트
pt_br: locatário
zh_cn: 租户

source: region
es: región
fr: région
ja: リージョン
ko: 지역
pt_br: região
zh_cn: 区域

source: cloud
ka: ღრუბელი
ko: 클라우드
